#+TITLE: Build_vendor_table
Goal is to combine ip-asn data from 3 sources
- peeringdb
- shadowserver.org
- pyasn
* Get company to asn list - delete heading below

#+BEGIN_SRC shell :results silent
gsutil cp ~/potaroo_company_asn.csv gs://ii_bq_scratch_dump/potaroo_company_asn.csv
#+END_SRC
#+BEGIN_SRC shell
gsutil ls -al gs://ii_bq_scratch_dump/potaroo_company_asn.csv
#+END_SRC

#+RESULTS:
#+begin_example
   3334138  2021-06-08T00:10:05Z  gs://ii_bq_scratch_dump/potaroo_company_asn.csv#1623111005815246  metageneration=1
TOTAL: 1 objects, 3334138 bytes (3.18 MiB)
#+end_example
#+BEGIN_SRC shell
cat potaroo_company_asn.csv | wc -l
#+END_SRC

#+RESULTS:
#+begin_example
0
#+end_example

** Get asns with all distinct start times
#+begin_src shell
bq query --nouse_legacy_sql 'select count(*) from `k8s-infra-ii-sandbox.k8s_artifacts_dataset_bb_test.shadow_ip_asn_extended_int`'
#+end_src

#+RESULTS:
#+begin_example
+--------+
|  f0_   |
+--------+
| 518099 |
+--------+
#+end_example

#+begin_src shell
bq query --nouse_legacy_sql 'select count(*) from `k8s-infra-ii-sandbox.k8s_artifacts_dataset_bb_test.pyasn_ip_asn_extended_int`'
#+end_src

#+RESULTS:
#+begin_example
+--------+
|  f0_   |
+--------+
| 923058 |
+--------+
#+end_example


#+begin_src shell
bq query --nouse_legacy_sql 'select asn, cidr_ip, start_ip, end_ip, start_ip_int, end_ip_1 from `k8s-infra-ii-sandbox.k8s_artifacts_dataset_bb_test.shadow_ip_asn_extended_int` as shadow inner join `k8s-infra-ii-sandbox.k8s_artifacts_dataset_bb_test.pyasn_ip_asn_extended_int` as pyasn on pyasn.asn=shadow.asn limit10'
#+end_src

#+RESULTS:
#+begin_example
#+end_example

** Post process org blocks
Just making sure we can get to json
#+NAME: json-res
#+BEGIN_SRC sql-mode :var json-r=""
select data from peeringdb.ixlan limit 1;
#+END_SRC

#+RESULTS: json-res
#+begin_SRC example
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}

#+end_SRC

Dang it I am missing something here....
#+BEGIN_SRC shell :process_r yes :post json-res[:process_r yes](*this*)
jq '.'
#+END_SRC

#+RESULTS:
#+begin_example
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}
#+end_example

** Wrap header for json.
#+BEGIN_SRC sql-mode :results sql :wrap EXPORT json
select data from peeringdb.ixlan limit 1;
#+END_SRC

#+RESULTS:
#+begin_EXPORT json
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}

#+end_EXPORT
